#### OpenTofu Format and Style 🖌`success`
#### OpenTofu Initialization ⚙️`success`
#### OpenTofu Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.

```

</details>

#### OpenTofu Plan 📖`success`

<details><summary>Show Plan</summary>

```

tofu
Acquiring state lock. This may take a few moments...
module.sebastian-toepfer.github_repository.workspaces: Refreshing state... [id=workspaces]
module.sebastian-toepfer.github_repository.repos["domain-driven-desgin"]: Refreshing state... [id=domain-driven-desgin]
module.sebastian-toepfer.github_repository.gh-common: Refreshing state... [id=gh-common]
module.sebastian-toepfer.github_repository.repos["bnf4j"]: Refreshing state... [id=bnf4j]
module.sebastian-toepfer.github_repository.pdf-test: Refreshing state... [id=pdf-test]
module.sebastian-toepfer.github_repository.repos["refaster"]: Refreshing state... [id=refaster]
module.sebastian-toepfer.github_repository.my-github: Refreshing state... [id=my-github]
module.sebastian-toepfer.github_repository.repos["openvdi"]: Refreshing state... [id=openvdi]
module.sebastian-toepfer.github_repository.repos["json-schema"]: Refreshing state... [id=json-schema]
module.sebastian-toepfer.github_repository.repos["json-rpc"]: Refreshing state... [id=json-rpc]
module.sebastian-toepfer.github_repository.repos["3d-models"]: Refreshing state... [id=3d-models]
module.sebastian-toepfer.github_repository.repos["pdfbox-fluent-layout"]: Refreshing state... [id=pdfbox-fluent-layout]
module.sebastian-toepfer.github_repository.repos["condition4j"]: Refreshing state... [id=condition4j]
module.sebastian-toepfer.github_repository.repos["learning-rust"]: Refreshing state... [id=learning-rust]
module.sebastian-toepfer.github_repository.repos["oss-mvn-parent"]: Refreshing state... [id=oss-mvn-parent]
module.sebastian-toepfer.github_repository.repos["json-printable-maven-plugin"]: Refreshing state... [id=json-printable-maven-plugin]
data.github_user.sebastian-toepfer: Reading...
data.github_user.sebastian-toepfer: Read complete after 0s [id=61313468]
module.sebastian-toepfer.github_actions_secret.unprotect-the-protected["oss-mvn-parent"]: Refreshing state... [id=oss-mvn-parent:unprotect_the_protected]
module.sebastian-toepfer.github_actions_secret.unprotect-the-protected["json-printable-maven-plugin"]: Refreshing state... [id=json-printable-maven-plugin:unprotect_the_protected]
module.sebastian-toepfer.github_actions_secret.unprotect-the-protected["pdfbox-fluent-layout"]: Refreshing state... [id=pdfbox-fluent-layout:unprotect_the_protected]
module.sebastian-toepfer.github_actions_secret.unprotect-the-protected["json-rpc"]: Refreshing state... [id=json-rpc:unprotect_the_protected]
module.sebastian-toepfer.github_actions_secret.unprotect-the-protected["openvdi"]: Refreshing state... [id=openvdi:unprotect_the_protected]
module.sebastian-toepfer.github_actions_secret.unprotect-the-protected["condition4j"]: Refreshing state... [id=condition4j:unprotect_the_protected]
module.sebastian-toepfer.github_actions_secret.unprotect-the-protected["bnf4j"]: Refreshing state... [id=bnf4j:unprotect_the_protected]
module.sebastian-toepfer.github_actions_secret.unprotect-the-protected["domain-driven-desgin"]: Refreshing state... [id=domain-driven-desgin:unprotect_the_protected]
module.sebastian-toepfer.github_actions_secret.unprotect-the-protected["json-schema"]: Refreshing state... [id=json-schema:unprotect_the_protected]
module.sebastian-toepfer.github_actions_secret.mvn-user["json-schema"]: Refreshing state... [id=json-schema:mvn_username]
module.sebastian-toepfer.github_actions_secret.mvn-user["oss-mvn-parent"]: Refreshing state... [id=oss-mvn-parent:mvn_username]
module.sebastian-toepfer.github_actions_secret.mvn-user["openvdi"]: Refreshing state... [id=openvdi:mvn_username]
module.sebastian-toepfer.github_actions_secret.mvn-user["domain-driven-desgin"]: Refreshing state... [id=domain-driven-desgin:mvn_username]
module.sebastian-toepfer.github_actions_secret.mvn-user["json-rpc"]: Refreshing state... [id=json-rpc:mvn_username]
module.sebastian-toepfer.github_actions_secret.mvn-user["pdfbox-fluent-layout"]: Refreshing state... [id=pdfbox-fluent-layout:mvn_username]
module.sebastian-toepfer.github_actions_secret.mvn-user["condition4j"]: Refreshing state... [id=condition4j:mvn_username]
module.sebastian-toepfer.github_actions_secret.mvn-user["json-printable-maven-plugin"]: Refreshing state... [id=json-printable-maven-plugin:mvn_username]
module.sebastian-toepfer.github_branch.default["pdfbox-fluent-layout"]: Refreshing state... [id=pdfbox-fluent-layout:main]
module.sebastian-toepfer.github_actions_secret.gpg-pwd["condition4j"]: Refreshing state... [id=condition4j:GPG_PASSPHRASE]
module.sebastian-toepfer.github_actions_secret.gpg-pwd["pdfbox-fluent-layout"]: Refreshing state... [id=pdfbox-fluent-layout:GPG_PASSPHRASE]
module.sebastian-toepfer.github_actions_secret.gpg-pwd["oss-mvn-parent"]: Refreshing state... [id=oss-mvn-parent:GPG_PASSPHRASE]
module.sebastian-toepfer.github_branch.default["json-rpc"]: Refreshing state... [id=json-rpc:main]
module.sebastian-toepfer.github_branch.default["json-schema"]: Refreshing state... [id=json-schema:main]
module.sebastian-toepfer.github_branch.default["bnf4j"]: Refreshing state... [id=bnf4j:main]
module.sebastian-toepfer.github_branch.default["oss-mvn-parent"]: Refreshing state... [id=oss-mvn-parent:main]
module.sebastian-toepfer.github_branch.default["condition4j"]: Refreshing state... [id=condition4j:main]
module.sebastian-toepfer.github_branch.default["domain-driven-desgin"]: Refreshing state... [id=domain-driven-desgin:main]
module.sebastian-toepfer.github_branch.default["json-printable-maven-plugin"]: Refreshing state... [id=json-printable-maven-plugin:main]
module.sebastian-toepfer.github_branch.default["openvdi"]: Refreshing state... [id=openvdi:main]
module.sebastian-toepfer.github_issue_label.semver-minor["openvdi"]: Refreshing state... [id=openvdi:semver-minor]
module.sebastian-toepfer.github_actions_secret.gpg-pwd["json-rpc"]: Refreshing state... [id=json-rpc:GPG_PASSPHRASE]
module.sebastian-toepfer.github_actions_secret.gpg-pwd["json-schema"]: Refreshing state... [id=json-schema:GPG_PASSPHRASE]
module.sebastian-toepfer.github_actions_secret.gpg-pwd["domain-driven-desgin"]: Refreshing state... [id=domain-driven-desgin:GPG_PASSPHRASE]
module.sebastian-toepfer.github_actions_secret.gpg-pwd["openvdi"]: Refreshing state... [id=openvdi:GPG_PASSPHRASE]
module.sebastian-toepfer.github_actions_secret.gpg-pwd["json-printable-maven-plugin"]: Refreshing state... [id=json-printable-maven-plugin:GPG_PASSPHRASE]
module.sebastian-toepfer.github_issue_label.semver-minor["oss-mvn-parent"]: Refreshing state... [id=oss-mvn-parent:semver-minor]
module.sebastian-toepfer.github_issue_label.semver-minor["pdfbox-fluent-layout"]: Refreshing state... [id=pdfbox-fluent-layout:semver-minor]
module.sebastian-toepfer.github_issue_label.semver-minor["domain-driven-desgin"]: Refreshing state... [id=domain-driven-desgin:semver-minor]
module.sebastian-toepfer.github_issue_label.semver-major["json-rpc"]: Refreshing state... [id=json-rpc:semver-major]
module.sebastian-toepfer.github_issue_label.semver-minor["json-rpc"]: Refreshing state... [id=json-rpc:semver-minor]
module.sebastian-toepfer.github_issue_label.semver-minor["json-printable-maven-plugin"]: Refreshing state... [id=json-printable-maven-plugin:semver-minor]
module.sebastian-toepfer.github_issue_label.semver-minor["json-schema"]: Refreshing state... [id=json-schema:semver-minor]
module.sebastian-toepfer.github_issue_label.semver-minor["condition4j"]: Refreshing state... [id=condition4j:semver-minor]
module.sebastian-toepfer.github_issue_label.semver-major["condition4j"]: Refreshing state... [id=condition4j:semver-major]
module.sebastian-toepfer.github_issue_label.semver-major["pdfbox-fluent-layout"]: Refreshing state... [id=pdfbox-fluent-layout:semver-major]
module.sebastian-toepfer.github_issue_label.semver-major["oss-mvn-parent"]: Refreshing state... [id=oss-mvn-parent:semver-major]
module.sebastian-toepfer.github_issue_label.semver-major["json-printable-maven-plugin"]: Refreshing state... [id=json-printable-maven-plugin:semver-major]
module.sebastian-toepfer.github_issue_label.semver-major["json-schema"]: Refreshing state... [id=json-schema:semver-major]
module.sebastian-toepfer.github_issue_label.semver-major["openvdi"]: Refreshing state... [id=openvdi:semver-major]
module.sebastian-toepfer.github_issue_label.semver-major["domain-driven-desgin"]: Refreshing state... [id=domain-driven-desgin:semver-major]
module.sebastian-toepfer.github_dependabot_secret.sonar-token["domain-driven-desgin"]: Refreshing state... [id=domain-driven-desgin:sonar_token]
module.sebastian-toepfer.github_dependabot_secret.sonar-token["json-schema"]: Refreshing state... [id=json-schema:sonar_token]
module.sebastian-toepfer.github_dependabot_secret.sonar-token["condition4j"]: Refreshing state... [id=condition4j:sonar_token]
module.sebastian-toepfer.github_dependabot_secret.sonar-token["json-rpc"]: Refreshing state... [id=json-rpc:sonar_token]
module.sebastian-toepfer.github_dependabot_secret.sonar-token["openvdi"]: Refreshing state... [id=openvdi:sonar_token]
module.sebastian-toepfer.github_dependabot_secret.sonar-token["json-printable-maven-plugin"]: Refreshing state... [id=json-printable-maven-plugin:sonar_token]
module.sebastian-toepfer.github_dependabot_secret.sonar-token["pdfbox-fluent-layout"]: Refreshing state... [id=pdfbox-fluent-layout:sonar_token]
module.sebastian-toepfer.github_dependabot_secret.sonar-token["bnf4j"]: Refreshing state... [id=bnf4j:sonar_token]
module.sebastian-toepfer.github_actions_secret.sonar-token["json-rpc"]: Refreshing state... [id=json-rpc:sonar_token]
module.sebastian-toepfer.github_actions_secret.sonar-token["pdfbox-fluent-layout"]: Refreshing state... [id=pdfbox-fluent-layout:sonar_token]
module.sebastian-toepfer.github_actions_secret.sonar-token["bnf4j"]: Refreshing state... [id=bnf4j:sonar_token]
module.sebastian-toepfer.github_actions_secret.sonar-token["domain-driven-desgin"]: Refreshing state... [id=domain-driven-desgin:sonar_token]
module.sebastian-toepfer.github_actions_secret.sonar-token["json-schema"]: Refreshing state... [id=json-schema:sonar_token]
module.sebastian-toepfer.github_actions_secret.sonar-token["openvdi"]: Refreshing state... [id=openvdi:sonar_token]
module.sebastian-toepfer.github_actions_secret.sonar-token["condition4j"]: Refreshing state... [id=condition4j:sonar_token]
module.sebastian-toepfer.github_actions_secret.sonar-token["json-printable-maven-plugin"]: Refreshing state... [id=json-printable-maven-plugin:sonar_token]
module.sebastian-toepfer.github_issue_label.semver-patch["json-schema"]: Refreshing state... [id=json-schema:semver-patch]
module.sebastian-toepfer.github_issue_label.semver-patch["openvdi"]: Refreshing state... [id=openvdi:semver-patch]
module.sebastian-toepfer.github_issue_label.semver-patch["condition4j"]: Refreshing state... [id=condition4j:semver-patch]
module.sebastian-toepfer.github_issue_label.semver-patch["pdfbox-fluent-layout"]: Refreshing state... [id=pdfbox-fluent-layout:semver-patch]
module.sebastian-toepfer.github_issue_label.semver-patch["json-rpc"]: Refreshing state... [id=json-rpc:semver-patch]
module.sebastian-toepfer.github_issue_label.semver-patch["domain-driven-desgin"]: Refreshing state... [id=domain-driven-desgin:semver-patch]
module.sebastian-toepfer.github_issue_label.semver-patch["json-printable-maven-plugin"]: Refreshing state... [id=json-printable-maven-plugin:semver-patch]
module.sebastian-toepfer.github_issue_label.semver-patch["oss-mvn-parent"]: Refreshing state... [id=oss-mvn-parent:semver-patch]
module.sebastian-toepfer.github_actions_secret.mvn-pwd["pdfbox-fluent-layout"]: Refreshing state... [id=pdfbox-fluent-layout:mvn_password]
module.sebastian-toepfer.github_actions_secret.mvn-pwd["json-rpc"]: Refreshing state... [id=json-rpc:mvn_password]
module.sebastian-toepfer.github_actions_secret.mvn-pwd["oss-mvn-parent"]: Refreshing state... [id=oss-mvn-parent:mvn_password]
module.sebastian-toepfer.github_actions_secret.mvn-pwd["json-printable-maven-plugin"]: Refreshing state... [id=json-printable-maven-plugin:mvn_password]
module.sebastian-toepfer.github_actions_secret.mvn-pwd["condition4j"]: Refreshing state... [id=condition4j:mvn_password]
module.sebastian-toepfer.github_actions_secret.mvn-pwd["openvdi"]: Refreshing state... [id=openvdi:mvn_password]
module.sebastian-toepfer.github_actions_secret.mvn-pwd["domain-driven-desgin"]: Refreshing state... [id=domain-driven-desgin:mvn_password]
module.sebastian-toepfer.github_actions_secret.mvn-pwd["json-schema"]: Refreshing state... [id=json-schema:mvn_password]
module.sebastian-toepfer.github_actions_secret.gpg-key["json-rpc"]: Refreshing state... [id=json-rpc:GPG_PRIVATE_KEY]
module.sebastian-toepfer.github_actions_secret.gpg-key["condition4j"]: Refreshing state... [id=condition4j:GPG_PRIVATE_KEY]
module.sebastian-toepfer.github_actions_secret.gpg-key["domain-driven-desgin"]: Refreshing state... [id=domain-driven-desgin:GPG_PRIVATE_KEY]
module.sebastian-toepfer.github_actions_secret.gpg-key["pdfbox-fluent-layout"]: Refreshing state... [id=pdfbox-fluent-layout:GPG_PRIVATE_KEY]
module.sebastian-toepfer.github_actions_secret.gpg-key["oss-mvn-parent"]: Refreshing state... [id=oss-mvn-parent:GPG_PRIVATE_KEY]
module.sebastian-toepfer.github_actions_secret.gpg-key["json-printable-maven-plugin"]: Refreshing state... [id=json-printable-maven-plugin:GPG_PRIVATE_KEY]
module.sebastian-toepfer.github_actions_secret.gpg-key["json-schema"]: Refreshing state... [id=json-schema:GPG_PRIVATE_KEY]
module.sebastian-toepfer.github_actions_secret.gpg-key["openvdi"]: Refreshing state... [id=openvdi:GPG_PRIVATE_KEY]
module.sebastian-toepfer.github_branch_protection.my-github: Refreshing state... [id=BPR_kwDOJijzwc4CuG1x]
module.sebastian-toepfer.github_branch.my-github_default: Refreshing state... [id=my-github:main]
module.sebastian-toepfer.github_branch_default.default["openvdi"]: Refreshing state... [id=openvdi]
module.sebastian-toepfer.github_branch_default.default["pdfbox-fluent-layout"]: Refreshing state... [id=pdfbox-fluent-layout]
module.sebastian-toepfer.github_branch_default.default["condition4j"]: Refreshing state... [id=condition4j]
module.sebastian-toepfer.github_branch_default.default["domain-driven-desgin"]: Refreshing state... [id=domain-driven-desgin]
module.sebastian-toepfer.github_branch_default.default["json-schema"]: Refreshing state... [id=json-schema]
module.sebastian-toepfer.github_branch_default.default["json-rpc"]: Refreshing state... [id=json-rpc]
module.sebastian-toepfer.github_branch_default.default["json-printable-maven-plugin"]: Refreshing state... [id=json-printable-maven-plugin]
module.sebastian-toepfer.github_branch_default.default["bnf4j"]: Refreshing state... [id=bnf4j]
module.sebastian-toepfer.github_branch_default.default["oss-mvn-parent"]: Refreshing state... [id=oss-mvn-parent]
module.sebastian-toepfer.github_branch_default.my-github: Refreshing state... [id=my-github]
module.sebastian-toepfer.github_branch_protection.default["bnf4j"]: Refreshing state... [id=BPR_kwDOLN1Nqc4Czz9A]
module.sebastian-toepfer.github_branch_protection.default["domain-driven-desgin"]: Refreshing state... [id=BPR_kwDOIo8AOc4CuG10]
module.sebastian-toepfer.github_branch_protection.default["pdfbox-fluent-layout"]: Refreshing state... [id=BPR_kwDOJKD6ys4CuG12]
module.sebastian-toepfer.github_branch_protection.default["json-rpc"]: Refreshing state... [id=BPR_kwDOJaCLls4C-UaH]
module.sebastian-toepfer.github_branch_protection.default["json-printable-maven-plugin"]: Refreshing state... [id=BPR_kwDOJryMAc4CuG1y]
module.sebastian-toepfer.github_branch_protection.default["condition4j"]: Refreshing state... [id=BPR_kwDOLTAIOM4CzMYq]
module.sebastian-toepfer.github_branch_protection.default["json-schema"]: Refreshing state... [id=BPR_kwDOKP44vM4CuG1z]
module.sebastian-toepfer.github_branch_protection.default["oss-mvn-parent"]: Refreshing state... [id=BPR_kwDOKvJnOM4DkupO]
module.sebastian-toepfer.github_branch_protection.default["openvdi"]: Refreshing state... [id=BPR_kwDOMSupFs4DGh2E]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

OpenTofu will perform the following actions:

  # module.sebastian-toepfer.github_actions_secret.gpg-key["condition4j"] will be created
  + resource "github_actions_secret" "gpg-key" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "condition4j"
      + secret_name     = "GPG_PRIVATE_KEY"
      + updated_at      = (known after apply)
    }

  # module.sebastian-toepfer.github_actions_secret.gpg-key["domain-driven-desgin"] will be created
  + resource "github_actions_secret" "gpg-key" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "domain-driven-desgin"
      + secret_name     = "GPG_PRIVATE_KEY"
      + updated_at      = (known after apply)
    }

  # module.sebastian-toepfer.github_actions_secret.gpg-key["json-printable-maven-plugin"] will be created
  + resource "github_actions_secret" "gpg-key" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "json-printable-maven-plugin"
      + secret_name     = "GPG_PRIVATE_KEY"
      + updated_at      = (known after apply)
    }

  # module.sebastian-toepfer.github_actions_secret.gpg-key["json-rpc"] will be created
  + resource "github_actions_secret" "gpg-key" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "json-rpc"
      + secret_name     = "GPG_PRIVATE_KEY"
      + updated_at      = (known after apply)
    }

  # module.sebastian-toepfer.github_actions_secret.gpg-key["json-schema"] will be created
  + resource "github_actions_secret" "gpg-key" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "json-schema"
      + secret_name     = "GPG_PRIVATE_KEY"
      + updated_at      = (known after apply)
    }

  # module.sebastian-toepfer.github_actions_secret.gpg-key["openvdi"] will be created
  + resource "github_actions_secret" "gpg-key" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "openvdi"
      + secret_name     = "GPG_PRIVATE_KEY"
      + updated_at      = (known after apply)
    }

  # module.sebastian-toepfer.github_actions_secret.gpg-key["oss-mvn-parent"] will be created
  + resource "github_actions_secret" "gpg-key" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "oss-mvn-parent"
      + secret_name     = "GPG_PRIVATE_KEY"
      + updated_at      = (known after apply)
    }

  # module.sebastian-toepfer.github_actions_secret.gpg-key["pdfbox-fluent-layout"] will be created
  + resource "github_actions_secret" "gpg-key" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "pdfbox-fluent-layout"
      + secret_name     = "GPG_PRIVATE_KEY"
      + updated_at      = (known after apply)
    }

  # module.sebastian-toepfer.github_branch_protection.my-github will be updated in-place
  ~ resource "github_branch_protection" "my-github" {
        id                              = "BPR_kwDOJijzwc4CuG1x"
        # (10 unchanged attributes hidden)

      ~ required_status_checks {
          ~ contexts = [
              + "Terraform Cloud/sebastian-toepfer/repo-id-uasZBgXRrDfocfie",
            ]
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 8 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so OpenTofu can't
guarantee to take exactly these actions if you run "tofu apply" now.

```

</details>

*Pusher: @sebastian-toepfer, Action: `pull_request`, Working Directory: ``, Workflow: `plan`*